### pandas tricks and trips in one file

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame(np.arange(1,101).reshape(25,4))

In [5]:
df.head()

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20

In [4]:
df[1:4]

    0   1   2   3
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [6]:
df.loc[0:5,0:3]

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20
5  21  22  23  24

In [7]:
df.iloc[0:2,0:2]

   0  1
0  1  2
1  5  6

In [3]:
df[[1,2]].head() #for two column fatch

    1   2
0   2   3
1   6   7
2  10  11
3  14  15
4  18  19